use securities_transactions;
-- Вставка данных в таблицу OrderType
INSERT INTO OrderType (Type) VALUES 
('Брокерская'),
('Дилерская');

-- Вставка данных в таблицу OrderVeriety
INSERT INTO OrderVeriety (Veriety) VALUES 
('Рыночная'),
('Лимитная'),
('Стоп-лосс');

-- Вставка данных в таблицу Currency
INSERT INTO Currency (CurrencyFull, CurrencyShort) VALUES 
('Российский рубль', 'RUB'),
('Американский доллар', 'USD'),
('Евро', 'EUR');

-- Вставка данных в таблицу _Order
INSERT INTO _Order (OrderVerietyID, OrderTypeID, CurrencyID, Tiker, Count, Type, Number, Data, Duration) VALUES 
(1, 1, 1, 'GAZP', 100, 'Покупка', 1, '2024-06-15 10:00:00', 30),
(2, 2, 2, 'AAPL', 50, 'Продажа', 2, '2024-06-15 11:00:00', 60),
(3, 1, 3, 'MSFT', 200, 'Покупка', 3, '2024-06-15 12:00:00', 45),
(1, 2, 1, 'SBER', 150, 'Продажа', 4, '2024-06-15 13:00:00', 90),
(2, 1, 2, 'TSLA', 30, 'Покупка', 5, '2024-06-15 14:00:00', 120),
(3, 2, 3, 'GOOGL', 80, 'Продажа', 6, '2024-06-15 15:00:00', 60),
(1, 1, 1, 'YNDX', 100, 'Покупка', 7, '2024-06-15 16:00:00', 30),
(2, 2, 2, 'AMZN', 75, 'Продажа', 8, '2024-06-15 17:00:00', 90),
(3, 1, 3, 'NFLX', 120, 'Покупка', 9, '2024-06-15 18:00:00', 60),
(1, 2, 1, 'ROSN', 90, 'Продажа', 10, '2024-06-15 19:00:00', 45);